mcci-catena/Arduino_Core_STM32/boards.txt
#
# File:	boards.txt
#
# Purpose:
#	Define all the boards for this board support package to the Arduino IDE
#
# Copyright:
#	Copyright (c) 2018-2023 MCCI Corporation
#
#	This library is free software; you can redistribute it and/or
#	modify it under the terms of the GNU Lesser General Public
#	License as published by the Free Software Foundation; either
#	version 2.1 of the License, or (at your option) any later version.
#
#	This library is distributed in the hope that it will be useful,
#	but WITHOUT ANY WARRANTY; without even the implied warranty of
#	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
#	See the GNU Lesser General Public License for more details.
#
#	You should have received a copy of the GNU Lesser General Public
#	License along with this library; if not, write to the Free Software
#	Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
#
# Author:
#	Generated by generate_boards.bri.
#
# Notes:
#	See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification
#

# Additional menu items
menu.lorawan_region=LoRaWAN Region
menu.lorawan_network=LoRaWAN Network
menu.lorawan_subband=LoRaWAN Subband

menu.xserial=Serial interface
menu.sysclk=System clock

menu.boot=Trusted boot

menu.opt=Optimize
menu.upload_method=Upload method

#
# Configuration information for MCCI Catena 4551
# See template in https://github.com/mcci-catena/Arduino_Core_STM32/boards.template
#
mcci_catena_4551.name=MCCI Catena 4551
mcci_catena_4551.build.vid=0x040E
mcci_catena_4551.build.pid=0x0041
mcci_catena_4551.vid.0=0x040E
mcci_catena_4551.pid.0=0x0041
mcci_catena_4551.build.usb_product="MCCI Catena 4551"
mcci_catena_4551.build.usb_manufacturer="MCCI Corporation"

mcci_catena_4551.build.core=arduino
mcci_catena_4551.build.board=MCCI_CATENA_4551
mcci_catena_4551.build.product_line=STM32L082xx

mcci_catena_4551.upload.maximum_size=196608
mcci_catena_4551.upload.maximum_data_size=20480
mcci_catena_4551.build.mcu=cortex-m0
mcci_catena_4551.build.series=STM32L0xx
mcci_catena_4551.build.variant=CATENA_4551
mcci_catena_4551.build.variant_extra_flags=
mcci_catena_4551.build.cmsis_lib_gcc=arm_cortexM0l_math
mcci_catena_4551.build.ldscript=
mcci_catena_4551.build.extra_flags=-DARDUINO_STM32 -DARDUINO_{build.series} -DARDUINO_{build.product_line} -DARDUINO_CATENA_4551 -D{build.product_line} {build.sysclk_flags} {build.xSerial} -D__CORTEX_SC=0 -D{build.board} {build.lorawan_flags} {build.lorawan_network_flags} {build.lorawan_subband_flags} {build.variant_extra_flags}
# mcci_catena_4551.build.c.Werror=
# mcci_catena_4551.build.cpp.Werror=
# mcci_catena_4551.build.S.Werror=
mcci_catena_4551.bootloader.tool=stm32l0_dfu
mcci_catena_4551.bootloader.file=McciBootloader_46xx

#
# menu.upload_method
mcci_catena_4551.menu.upload_method.DFU_bl=DFU (include bootloader)
mcci_catena_4551.menu.upload_method.DFU_bl.upload.tool=stm32l0_dfu_bootloader
mcci_catena_4551.menu.upload_method.DFU_bl.upload.protocol=dfu
mcci_catena_4551.menu.upload_method.DFU_bl.upload.maximum_size=172032
mcci_catena_4551.menu.upload_method.DFU_bl.upload.maximum_data_size=20480

mcci_catena_4551.menu.upload_method.DFU=DFU
mcci_catena_4551.menu.upload_method.DFU.upload.tool=stm32l0_dfu
mcci_catena_4551.menu.upload_method.DFU.upload.protocol=dfu
mcci_catena_4551.menu.upload_method.DFU.upload.maximum_size=196608
mcci_catena_4551.menu.upload_method.DFU.upload.maximum_data_size=20480

mcci_catena_4551.menu.upload_method.STLink_bl=STLink (include bootloader)
mcci_catena_4551.menu.upload_method.STLink_bl.upload.protocol=STLink
mcci_catena_4551.menu.upload_method.STLink_bl.upload.tool=stlink_upload_bootloader
mcci_catena_4551.menu.upload_method.STLink_bl.upload.maximum_size=172032
mcci_catena_4551.menu.upload_method.STLink_bl.upload.maximum_data_size=20480

mcci_catena_4551.menu.upload_method.STLink=STLink
mcci_catena_4551.menu.upload_method.STLink.upload.protocol=STLink
mcci_catena_4551.menu.upload_method.STLink.upload.tool=stlink_upload
mcci_catena_4551.menu.upload_method.STLink.upload.maximum_size=196608
mcci_catena_4551.menu.upload_method.STLink.upload.maximum_data_size=20480

#mcci_catena_4551.menu.upload_method.Serial=Serial
#mcci_catena_4551.menu.upload_method.Serial.upload.protocol=Serial
#mcci_catena_4551.menu.upload_method.Serial.upload.tool=serial_upload

#
# menu.xserial
mcci_catena_4551.menu.xserial.usb=USB Serial
mcci_catena_4551.menu.xserial.generic=Generic Serial
mcci_catena_4551.menu.xserial.none=No Serial
mcci_catena_4551.menu.xserial.usbhwserial=USB + HW Serial
mcci_catena_4551.menu.xserial.usb.build.xSerial={build.usb_flags} -DARDUINO_BSP_CONFIG_SERIAL_MASK=0x1
mcci_catena_4551.menu.xserial.generic.build.xSerial=-DARDUINO_BSP_CONFIG_SERIAL_MASK=0x2
mcci_catena_4551.menu.xserial.none.build.xSerial=-DARDUINO_BSP_CONFIG_SERIAL_MASK=0x0
mcci_catena_4551.menu.xserial.usbhwserial.build.xSerial={build.usb_flags} -DARDUINO_BSP_CONFIG_SERIAL_MASK=0x3

#
# menu.sysclk
mcci_catena_4551.menu.sysclk.pll32m=32 MHz (most power)
mcci_catena_4551.menu.sysclk.pll24m=24 MHz
mcci_catena_4551.menu.sysclk.hsi16m=16 MHz
mcci_catena_4551.menu.sysclk.msi4194k=4.194 MHz (no USB)
mcci_catena_4551.menu.sysclk.msi2097k=2.097 MHz (no USB, least power)
mcci_catena_4551.menu.sysclk.pll32m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=32
mcci_catena_4551.menu.sysclk.pll24m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=24
mcci_catena_4551.menu.sysclk.hsi16m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=16
mcci_catena_4551.menu.sysclk.msi4194k.build.sysclk_flags=-DCATENA_CFG_SYSCLK=4
mcci_catena_4551.menu.sysclk.msi2097k.build.sysclk_flags=-DCATENA_CFG_SYSCLK=2

#
# menu.bootloader
mcci_catena_4551.menu.boot.trusted=MCCI Trusted Boot
mcci_catena_4551.menu.boot.basic=Basic (no bootloader)

# convert boot selections to settings
mcci_catena_4551.menu.boot.basic.build.ldscript=../mcci-ldscript-basic.ld
mcci_catena_4551.menu.boot.basic.build.baseaddr=0x08000000
mcci_catena_4551.menu.boot.trusted.build.ldscript=../mcci-ldscript-trusted.ld
mcci_catena_4551.menu.boot.trusted.build.baseaddr=0x08005000

#
# menu.opt
mcci_catena_4551.menu.opt.osstd=Smallest (-Os default)
mcci_catena_4551.menu.opt.osstd.build.flags.optimize=-Os
mcci_catena_4551.menu.opt.osstd.build.flags.ldspecs=
# mcci_catena_4551.menu.opt.oslto=Smallest (-Os) with LTO
# mcci_catena_4551.menu.opt.oslto.build.flags.optimize=-Os -flto
# mcci_catena_4551.menu.opt.oslto.build.flags.ldspecs=-flto
mcci_catena_4551.menu.opt.o1std=Fast (-O1)
mcci_catena_4551.menu.opt.o1std.build.flags.optimize=-O1
mcci_catena_4551.menu.opt.o1std.build.flags.ldspecs=
# mcci_catena_4551.menu.opt.o1lto=Fast (-O1) with LTO
# mcci_catena_4551.menu.opt.o1lto.build.flags.optimize=-O1 -flto
# mcci_catena_4551.menu.opt.o1lto.build.flags.ldspecs=-flto
mcci_catena_4551.menu.opt.o2std=Faster (-O2)
mcci_catena_4551.menu.opt.o2std.build.flags.optimize=-O2
mcci_catena_4551.menu.opt.o2std.build.flags.ldspecs=
# mcci_catena_4551.menu.opt.o2lto=Faster (-O2) with LTO
# mcci_catena_4551.menu.opt.o2lto.build.flags.optimize=-O2 -flto
# mcci_catena_4551.menu.opt.o2lto.build.flags.ldspecs=-flto
mcci_catena_4551.menu.opt.o3std=Fastest (-O3)
mcci_catena_4551.menu.opt.o3std.build.flags.optimize=-O3
mcci_catena_4551.menu.opt.o3std.build.flags.ldspecs=
# mcci_catena_4551.menu.opt.o3lto=Fastest (-O3) with LTO
# mcci_catena_4551.menu.opt.o3lto.build.flags.optimize=-O3 -flto
# mcci_catena_4551.menu.opt.o3lto.build.flags.ldspecs=-flto
mcci_catena_4551.menu.opt.ogstd=Debug (-g)
mcci_catena_4551.menu.opt.ogstd.build.flags.optimize=-Og -gdwarf-2
mcci_catena_4551.menu.opt.ogstd.build.flags.ldspecs=

#
# menu.lorawan_region
mcci_catena_4551.menu.lorawan_region.us915=North America 915 MHz
mcci_catena_4551.menu.lorawan_region.eu868=Europe 868 MHz
mcci_catena_4551.menu.lorawan_region.au915=Australia 915 MHz
mcci_catena_4551.menu.lorawan_region.as923=Asia 923 MHz
mcci_catena_4551.menu.lorawan_region.as923jp=Japan 923 MHz
mcci_catena_4551.menu.lorawan_region.kr920=Korea 920 MHz
mcci_catena_4551.menu.lorawan_region.in866=India 866 MHz
mcci_catena_4551.menu.lorawan_region.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.us915.build.lorawan_flags=-DCFG_us915=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.eu868.build.lorawan_flags=-DCFG_eu868=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.au915.build.lorawan_flags=-DCFG_au921=1 -DCFG_au915=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.as923.build.lorawan_flags=-DCFG_as923=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.as923jp.build.lorawan_flags=-DCFG_as923=1 -DLMIC_COUNTRY_CODE=LMIC_COUNTRY_CODE_JP -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.kr920.build.lorawan_flags=-DCFG_kr920=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.in866.build.lorawan_flags=-DCFG_in866=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_region.projcfg.build.lorawan_flags=

#
# menu.lorawan_network
mcci_catena_4551.menu.lorawan_network.ttn=The Things Network
mcci_catena_4551.menu.lorawan_network.ttn.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_TTN=1
mcci_catena_4551.menu.lorawan_network.actility=Actility ThingsPark
mcci_catena_4551.menu.lorawan_network.actility.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_ACTILITY=1
mcci_catena_4551.menu.lorawan_network.helium=Helium
mcci_catena_4551.menu.lorawan_network.helium.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_HELIUM=1
mcci_catena_4551.menu.lorawan_network.machineq=machineQ
mcci_catena_4551.menu.lorawan_network.machineq.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_MACHINEQ=1
mcci_catena_4551.menu.lorawan_network.senet=Senet
mcci_catena_4551.menu.lorawan_network.senet.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENET=1
mcci_catena_4551.menu.lorawan_network.senra=Senra
mcci_catena_4551.menu.lorawan_network.senra.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENRA=1
mcci_catena_4551.menu.lorawan_network.swisscom=Swisscom
mcci_catena_4551.menu.lorawan_network.swisscom.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SWISSCOM=1
mcci_catena_4551.menu.lorawan_network.chirpstack=ChirpStack
mcci_catena_4551.menu.lorawan_network.chirpstack.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_CHIRPSTACK=1
mcci_catena_4551.menu.lorawan_network.generic=Generic
mcci_catena_4551.menu.lorawan_network.generic.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_GENERIC=1
mcci_catena_4551.menu.lorawan_network.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4551.menu.lorawan_network.projcfg.build.lorawan_network_flags=

#
# menul.lorawan_subband
mcci_catena_4551.menu.lorawan_subband.default=Default, works everywhere
mcci_catena_4551.menu.lorawan_subband.default.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=-1
mcci_catena_4551.menu.lorawan_subband.sb0=sb0, ch 0~7 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb0.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=0
mcci_catena_4551.menu.lorawan_subband.sb1=sb1, ch 8~15 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb1.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=1
mcci_catena_4551.menu.lorawan_subband.sb2=sb2, ch 16~23 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb2.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=2
mcci_catena_4551.menu.lorawan_subband.sb3=sb3, ch 24~31 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb3.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=3
mcci_catena_4551.menu.lorawan_subband.sb4=sb4, ch 32~39 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb4.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=4
mcci_catena_4551.menu.lorawan_subband.sb5=sb5, ch 40~47 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb5.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=5
mcci_catena_4551.menu.lorawan_subband.sb6=sb6, ch 48~55 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb6.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=6
mcci_catena_4551.menu.lorawan_subband.sb7=sb7, ch 56~63 (US/AU/CN470)
mcci_catena_4551.menu.lorawan_subband.sb7.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=7
mcci_catena_4551.menu.lorawan_subband.sb8=sb8, ch 64~71 (CN470)
mcci_catena_4551.menu.lorawan_subband.sb8.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=8
mcci_catena_4551.menu.lorawan_subband.sb9=sb9, ch 72~79 (CN470)
mcci_catena_4551.menu.lorawan_subband.sb9.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=9
mcci_catena_4551.menu.lorawan_subband.sb10=sb10, ch 80~87 (CN470)
mcci_catena_4551.menu.lorawan_subband.sb10.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=10
mcci_catena_4551.menu.lorawan_subband.sb11=sb11, ch 88~95 (CN470)
mcci_catena_4551.menu.lorawan_subband.sb11.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=11

#### end of configuration info for MCCI Catena 4551

#
# Configuration information for MCCI Catena 4610
# See template in https://github.com/mcci-catena/Arduino_Core_STM32/boards.template
#
mcci_catena_4610.name=MCCI Catena 4610
mcci_catena_4610.build.vid=0x040E
mcci_catena_4610.build.pid=0x00A1
mcci_catena_4610.vid.0=0x040E
mcci_catena_4610.pid.0=0x00A1
mcci_catena_4610.build.usb_product="MCCI Catena 4610"
mcci_catena_4610.build.usb_manufacturer="MCCI Corporation"

mcci_catena_4610.build.core=arduino
mcci_catena_4610.build.board=MCCI_CATENA_4610
mcci_catena_4610.build.product_line=STM32L082xx

mcci_catena_4610.upload.maximum_size=196608
mcci_catena_4610.upload.maximum_data_size=20480
mcci_catena_4610.build.mcu=cortex-m0
mcci_catena_4610.build.series=STM32L0xx
mcci_catena_4610.build.variant=CATENA_461x
mcci_catena_4610.build.variant_extra_flags=-DMCCI_CATENA_461x_PA0_SWITCHES_VDD=0
mcci_catena_4610.build.cmsis_lib_gcc=arm_cortexM0l_math
mcci_catena_4610.build.ldscript=
mcci_catena_4610.build.extra_flags=-DARDUINO_STM32 -DARDUINO_{build.series} -DARDUINO_{build.product_line}  -D{build.product_line} {build.sysclk_flags} {build.xSerial} -D__CORTEX_SC=0 -D{build.board} {build.lorawan_flags} {build.lorawan_network_flags} {build.lorawan_subband_flags} {build.variant_extra_flags}
# mcci_catena_4610.build.c.Werror=
# mcci_catena_4610.build.cpp.Werror=
# mcci_catena_4610.build.S.Werror=
mcci_catena_4610.bootloader.tool=stm32l0_dfu
mcci_catena_4610.bootloader.file=McciBootloader_46xx

#
# menu.upload_method
mcci_catena_4610.menu.upload_method.DFU_bl=DFU (include bootloader)
mcci_catena_4610.menu.upload_method.DFU_bl.upload.tool=stm32l0_dfu_bootloader
mcci_catena_4610.menu.upload_method.DFU_bl.upload.protocol=dfu
mcci_catena_4610.menu.upload_method.DFU_bl.upload.maximum_size=172032
mcci_catena_4610.menu.upload_method.DFU_bl.upload.maximum_data_size=20480

mcci_catena_4610.menu.upload_method.DFU=DFU
mcci_catena_4610.menu.upload_method.DFU.upload.tool=stm32l0_dfu
mcci_catena_4610.menu.upload_method.DFU.upload.protocol=dfu
mcci_catena_4610.menu.upload_method.DFU.upload.maximum_size=196608
mcci_catena_4610.menu.upload_method.DFU.upload.maximum_data_size=20480

mcci_catena_4610.menu.upload_method.STLink_bl=STLink (include bootloader)
mcci_catena_4610.menu.upload_method.STLink_bl.upload.protocol=STLink
mcci_catena_4610.menu.upload_method.STLink_bl.upload.tool=stlink_upload_bootloader
mcci_catena_4610.menu.upload_method.STLink_bl.upload.maximum_size=172032
mcci_catena_4610.menu.upload_method.STLink_bl.upload.maximum_data_size=20480

mcci_catena_4610.menu.upload_method.STLink=STLink
mcci_catena_4610.menu.upload_method.STLink.upload.protocol=STLink
mcci_catena_4610.menu.upload_method.STLink.upload.tool=stlink_upload
mcci_catena_4610.menu.upload_method.STLink.upload.maximum_size=196608
mcci_catena_4610.menu.upload_method.STLink.upload.maximum_data_size=20480

#mcci_catena_4610.menu.upload_method.Serial=Serial
#mcci_catena_4610.menu.upload_method.Serial.upload.protocol=Serial
#mcci_catena_4610.menu.upload_method.Serial.upload.tool=serial_upload

#
# menu.xserial
mcci_catena_4610.menu.xserial.usb=USB Serial
mcci_catena_4610.menu.xserial.generic=Generic Serial
mcci_catena_4610.menu.xserial.none=No Serial
mcci_catena_4610.menu.xserial.usbhwserial=USB + HW Serial
mcci_catena_4610.menu.xserial.usb.build.xSerial={build.usb_flags} -DARDUINO_BSP_CONFIG_SERIAL_MASK=0x1
mcci_catena_4610.menu.xserial.generic.build.xSerial=-DARDUINO_BSP_CONFIG_SERIAL_MASK=0x2
mcci_catena_4610.menu.xserial.none.build.xSerial=-DARDUINO_BSP_CONFIG_SERIAL_MASK=0x0
mcci_catena_4610.menu.xserial.usbhwserial.build.xSerial={build.usb_flags} -DARDUINO_BSP_CONFIG_SERIAL_MASK=0x3

#
# menu.sysclk
mcci_catena_4610.menu.sysclk.pll32m=32 MHz (most power)
mcci_catena_4610.menu.sysclk.pll24m=24 MHz
mcci_catena_4610.menu.sysclk.hsi16m=16 MHz
mcci_catena_4610.menu.sysclk.msi4194k=4.194 MHz (no USB)
mcci_catena_4610.menu.sysclk.msi2097k=2.097 MHz (no USB, least power)
mcci_catena_4610.menu.sysclk.pll32m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=32
mcci_catena_4610.menu.sysclk.pll24m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=24
mcci_catena_4610.menu.sysclk.hsi16m.build.sysclk_flags=-DCATENA_CFG_SYSCLK=16
mcci_catena_4610.menu.sysclk.msi4194k.build.sysclk_flags=-DCATENA_CFG_SYSCLK=4
mcci_catena_4610.menu.sysclk.msi2097k.build.sysclk_flags=-DCATENA_CFG_SYSCLK=2

