mcci-catena/Arduino_Core_STM32/boards.txt
#
# menu.lorawan_network
mcci_model_4917.menu.lorawan_network.ttn=The Things Network
mcci_model_4917.menu.lorawan_network.ttn.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_TTN=1
mcci_model_4917.menu.lorawan_network.actility=Actility ThingsPark
mcci_model_4917.menu.lorawan_network.actility.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_ACTILITY=1
mcci_model_4917.menu.lorawan_network.helium=Helium
mcci_model_4917.menu.lorawan_network.helium.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_HELIUM=1
mcci_model_4917.menu.lorawan_network.machineq=machineQ
mcci_model_4917.menu.lorawan_network.machineq.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_MACHINEQ=1
mcci_model_4917.menu.lorawan_network.senet=Senet
mcci_model_4917.menu.lorawan_network.senet.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENET=1
mcci_model_4917.menu.lorawan_network.senra=Senra
mcci_model_4917.menu.lorawan_network.senra.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENRA=1
mcci_model_4917.menu.lorawan_network.swisscom=Swisscom
mcci_model_4917.menu.lorawan_network.swisscom.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SWISSCOM=1
mcci_model_4917.menu.lorawan_network.chirpstack=ChirpStack
mcci_model_4917.menu.lorawan_network.chirpstack.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_CHIRPSTACK=1
mcci_model_4917.menu.lorawan_network.generic=Generic
mcci_model_4917.menu.lorawan_network.generic.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_GENERIC=1
mcci_model_4917.menu.lorawan_network.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_model_4917.menu.lorawan_network.projcfg.build.lorawan_network_flags=

#
# menul.lorawan_subband
mcci_model_4917.menu.lorawan_subband.default=Default, works everywhere
mcci_model_4917.menu.lorawan_subband.default.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=-1
mcci_model_4917.menu.lorawan_subband.sb0=sb0, ch 0~7 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb0.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=0
mcci_model_4917.menu.lorawan_subband.sb1=sb1, ch 8~15 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb1.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=1
mcci_model_4917.menu.lorawan_subband.sb2=sb2, ch 16~23 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb2.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=2
mcci_model_4917.menu.lorawan_subband.sb3=sb3, ch 24~31 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb3.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=3
mcci_model_4917.menu.lorawan_subband.sb4=sb4, ch 32~39 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb4.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=4
mcci_model_4917.menu.lorawan_subband.sb5=sb5, ch 40~47 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb5.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=5
mcci_model_4917.menu.lorawan_subband.sb6=sb6, ch 48~55 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb6.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=6
mcci_model_4917.menu.lorawan_subband.sb7=sb7, ch 56~63 (US/AU/CN470)
mcci_model_4917.menu.lorawan_subband.sb7.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=7
mcci_model_4917.menu.lorawan_subband.sb8=sb8, ch 64~71 (CN470)
mcci_model_4917.menu.lorawan_subband.sb8.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=8
mcci_model_4917.menu.lorawan_subband.sb9=sb9, ch 72~79 (CN470)
mcci_model_4917.menu.lorawan_subband.sb9.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=9
mcci_model_4917.menu.lorawan_subband.sb10=sb10, ch 80~87 (CN470)
mcci_model_4917.menu.lorawan_subband.sb10.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=10
mcci_model_4917.menu.lorawan_subband.sb11=sb11, ch 88~95 (CN470)
mcci_model_4917.menu.lorawan_subband.sb11.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=11

#### end of configuration info for MCCI Model 4917

#
# Configuration information for MCCI Model 4931
# See template in https://github.com/mcci-catena/Arduino_Core_STM32/boards.template
#
mcci_model_4931.name=MCCI Model 4931
mcci_model_4931.build.vid=0x040E
mcci_model_4931.build.pid=0x0215
mcci_model_4931.vid.0=0x040E
mcci_model_4931.pid.0=0x0215
mcci_model_4931.build.usb_product="MCCI Model 4931"
mcci_model_4931.build.usb_manufacturer="MCCI Corporation"

mcci_model_4931.build.core=arduino
mcci_model_4931.build.board=MCCI_MODEL_4931
mcci_model_4931.build.product_line=STM32L082xx

mcci_model_4931.upload.maximum_size=196608
mcci_model_4931.upload.maximum_data_size=20480
mcci_model_4931.build.mcu=cortex-m0
mcci_model_4931.build.series=STM32L0xx
mcci_model_4931.build.variant=MODEL_4931
mcci_model_4931.build.variant_extra_flags=
mcci_model_4931.build.cmsis_lib_gcc=arm_cortexM0l_math
mcci_model_4931.build.ldscript=
mcci_model_4931.build.extra_flags=-DARDUINO_STM32 -DARDUINO_{build.series} -DARDUINO_{build.product_line} -DARDUINO_MODEL_4931 -D{build.product_line} {build.sysclk_flags} {build.xSerial} -D__CORTEX_SC=0 -D{build.board} {build.lorawan_flags} {build.lorawan_network_flags} {build.lorawan_subband_flags} {build.variant_extra_flags}
# mcci_model_4931.build.c.Werror=
# mcci_model_4931.build.cpp.Werror=
# mcci_model_4931.build.S.Werror=
mcci_model_4931.bootloader.tool=stm32l0_dfu
mcci_model_4931.bootloader.file=McciBootloader_46xx

#
# menu.upload_method
mcci_model_4931.menu.upload_method.DFU_bl=DFU (include bootloader)
mcci_model_4931.menu.upload_method.DFU_bl.upload.tool=stm32l0_dfu_bootloader
mcci_model_4931.menu.upload_method.DFU_bl.upload.protocol=dfu
mcci_model_4931.menu.upload_method.DFU_bl.upload.maximum_size=172032
mcci_model_4931.menu.upload_method.DFU_bl.upload.maximum_data_size=20480

mcci_model_4931.menu.upload_method.DFU=DFU
mcci_model_4931.menu.upload_method.DFU.upload.tool=stm32l0_dfu
mcci_model_4931.menu.upload_method.DFU.upload.protocol=dfu
mcci_model_4931.menu.upload_method.DFU.upload.maximum_size=196608
mcci_model_4931.menu.upload_method.DFU.upload.maximum_data_size=20480

mcci_model_4931.menu.upload_method.STLink_bl=STLink (include bootloader)
mcci_model_4931.menu.upload_method.STLink_bl.upload.protocol=STLink
mcci_model_4931.menu.upload_method.STLink_bl.upload.tool=stlink_upload_bootloader
mcci_model_4931.menu.upload_method.STLink_bl.upload.maximum_size=172032
mcci_model_4931.menu.upload_method.STLink_bl.upload.maximum_data_size=20480

mcci_model_4931.menu.upload_method.STLink=STLink
mcci_model_4931.menu.upload_method.STLink.upload.protocol=STLink
mcci_model_4931.menu.upload_method.STLink.upload.tool=stlink_upload
mcci_model_4931.menu.upload_method.STLink.upload.maximum_size=196608
mcci_model_4931.menu.upload_method.STLink.upload.maximum_data_size=20480

